Revit 2027 API
FamilySizeTableErrorInfo Properties
The FamilySizeTableErrorInfo type exposes the following members.
Properties
Name | Description
FamilySizeTableErrorType |  The error type.
FilePath |  The path of the imported CSV file.
InvalidColumnIndex |  The index of the invalid column.
InvalidHeaderText |  The invalid header text.
InvalidRowIndex |  The index of the invalid row.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
See Also
Reference
FamilySizeTableErrorInfo Class
Autodesk.Revit.DB Namespace